desafio/desafio2/app/views/tasks/_form.html.erb

SELECT "anexos".* FROM "anexos" WHERE "anexos"."task_id" = ?  [["task_id", 1]]
---
    <ul>
      <% @task.anexos.each do |anexo| %>