desafio/desafio2/app/views/tasks/show.html.erb

SELECT "anexos".* FROM "anexos" WHERE "anexos"."task_id" = ?  [["task_id", 1]]
---
  <strong>Anexos:</strong>
  <% @task.anexos.each do |anexo| %>