desafio2/exercicio2/exercicio2/app/controllers/images_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    image = Image.find(params[:id])

INSERT INTO "images" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "b737_5.jpg"], ["created_at", "2017-10-17 04:56:39.265600"], ["updated_at", "2017-10-17 04:56:39.265600"]]
---
  def create
    images = get_images_from_api

    images_objects = []
    images.each do |image|
      img_name = image["url"].split("/").last
      img_stream = HTTParty.get(image["url"])
      images_objects << Image.create_image(img_name, img_stream)