desafio/desafio2/app/controllers/anexos_controller.rb

SELECT  "anexos".* FROM "anexos" WHERE "anexos"."id" = ? LIMIT 1  [["id", 1]]
---
  def get_file
    anexo = Anexo.find(params[:id])