desafio/desafio2/app/controllers/anexos_controller.rb

  def show
    anexo = Anexo.find(params[:id])
---
SELECT  "anexos".* FROM "anexos" WHERE "anexos"."id" = ? LIMIT 1  [["id", 3]]