desafio/desafio2/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("nome", "prioridade", "descricao", "created_at", "updated_at", "status", "criador_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nome", "aaaaa"], ["prioridade", 1], ["descricao", "aaaaa"], ["created_at", "2017-10-06 07:35:03.548422"], ["updated_at", "2017-10-06 07:35:03.548422"], ["status", 0], ["criador_id", 1]]
---
  def create
    @task = Task.new(task_params)
    @task.assign_user_from_controller(current_user)

    respond_to do |format|
      if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
  def complete
    @task = Task.find(params[:id])

UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", 1], ["updated_at", "2017-10-06 09:06:02.002820"], ["id", 1]]
INSERT INTO "anexos" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "alugueis"], ["created_at", "2017-10-06 08:51:53.587218"], ["updated_at", "2017-10-06 08:51:53.587218"]]
UPDATE "anexos" SET "myme_type" = ?, "path" = ?, "task_id" = ?, "updated_at" = ? WHERE "anexos"."id" = ?  [["myme_type", "text/csv"], ["path", "/home/rodrigo/docker/paradigmas/desafio/desafio2/documents/admission_date.csv"], ["task_id", 1], ["updated_at", "2017-10-06 09:02:52.124334"], ["id", 1]]
---
  def update
    respond_to do |format|
      has_error = false
      has_error = @task.update(task_params) == false
      unless has_error
        has_error = Anexo.save(params[:task][:anexo], @task.id) == false